; domain
(define (domain fetch-domain)
  (:requirements :strips :typing)
  (:types room treat)
  
  (:predicates
    (at ?r - room)           ; the agent is in room ?r
    (connected ?r1 ?r2 - room) ; room ?r1 is connected to room ?r2
    (treat-at ?t - treat ?r - room) ; treat ?t is at room ?r
    (has-treat ?t - treat)          ; agent has treat ?t
  )

  (:action pickup
    :parameters (?t - treat ?r - room)
    :precondition (and (at ?r) (treat-at ?t ?r))
    :effect (and
              (not (treat-at ?t ?r))
              (has-treat ?t)
            )
  )

  (:action drop
    :parameters (?t - treat ?r - room)
    :precondition (and (at ?r) (has-treat ?t))
    :effect (and
              (not (has-treat ?t))
              (treat-at ?t ?r)
            )
  )
  
  (:action move
    :parameters (?from ?to - room)
    :precondition (and (at ?from) (connected ?from ?to))
    :effect (and
              (not (at ?from))
              (at ?to)
            )
  )
)

; problem
(define (problem fetch-treat)
    (:domain fetch-domain)
    (:objects
        roomA roomB roomC roomD - room
        treat1 - treat
    )
    (:init
        (at roomA)
        (treat-at treat1 roomD)
        (connected roomA roomB)
        (connected roomB roomC)
        (connected roomC roomD)
        (connected roomD roomC)
        (connected roomC roomB)
        (connected roomB roomA)
    )
    (:goal
        (and
            (at roomA)
            (has-treat treat1)
        )
    )
)

; plan
1. (move rooma roomb)
   deleted: (at rooma)
   added: (at roomb)
   goals met: 0 of 2
2. (move roomb roomc)
   deleted: (at roomb)
   added: (at roomc)
   goals met: 0 of 2
3. (move roomc roomd)
   deleted: (at roomc)
   added: (at roomd)
   goals met: 0 of 2
4. (pickup treat1 roomd)
   deleted: (treat-at treat1 roomd)
   added: (has-treat treat1)
   goals met: 1 of 2
5. (move roomd roomc)
   deleted: (at roomd)
   added: (at roomc)
   goals met: 1 of 2
6. (move roomc roomb)
   deleted: (at roomc)
   added: (at roomb)
   goals met: 1 of 2
7. (move roomb rooma)
   deleted: (at roomb)
   added: (at rooma)
   goals met: 2 of 2
